# St7GetLoadCaseGravity

Returns the value of the acceleration due to gravity for the specified load case of type lcGravity.

long St7GetLoadCaseGravity(long uID, long CaseNum, double* Gravity)

Input Parameters

uID

Strand7 model file ID.

CaseNum

Load case number.

Output Parameters

Gravity

Acceleration due to gravity.